app/controllers/admin/tools_controller.rb

SELECT "tools".* FROM "tools" WHERE (((name like '%the%') OR (description like '%the%')) OR ((name like '%testing%') OR (description like '%testing%'))) LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "tools"
---
  def index
    if params[:search]
      search_tools
      @tools = @tools.paginate(:page => params[:page], :per_page => 25)
    else
      @tools = Tool.paginate(:page => params[:page], :per_page => 25)

SELECT "tools".* FROM "tools" WHERE "tools"."id" = 1 LIMIT 1
---
  def show
    @tool = Tool.find(params[:id])

SELECT "tools".* FROM "tools" WHERE "tools"."id" = 1 LIMIT 1
---
  def edit
    @tool = Tool.find(params[:id])

SELECT "tools".* FROM "tools" WHERE "tools"."id" = 4 LIMIT 1
UPDATE "tools" SET "why_asset_mapping" = 't', "why_budgeting" = 'f', "why_solution_building" = 'f', "why_leadership_building" = 'f', "why_needs_analysis" = 'f', "updated_at" = '2011-09-18 17:37:41.373746', "why_team_building" = 'f', "why_action_planning" = 'f', "why_community_building" = 'f', "why_collective_visioning" = 'f' WHERE "tools"."id" = 1
---
  def update
    @tool = Tool.find(params[:id])
    if @tool.update_attributes(params[:tool])

INSERT INTO "tools" ("other_resources_needed", "software", "reading_level", "time_to_use", "electronics_equipment", "expertise_needed", "created_at", "updated_at", "method_of_access", "activities_involved", "name", "jargon", "steps", "cost_to_obtain", "cost_to_use") VALUES (NULL, NULL, 'Grade 5/6', NULL, NULL, NULL, '2011-09-12 00:16:31.153345', '2011-09-12 00:16:31.153345', NULL, NULL, 'test', 'A little', 'Some', NULL, NULL)
---
  def create
    @tool = Tool.new(params[:tool])
    if @tool.save

SELECT "tools".* FROM "tools" WHERE "tools"."id" = 5 LIMIT 1
DELETE FROM "tools" WHERE "tools"."id" = 5
---
  def destroy
    @tool = Tool.find(params[:id])
    @tool.destroy