app/controllers/tools_controller.rb

SELECT "tools".* FROM "tools" WHERE (((name like '%blah%') OR (description like '%blah%'))) LIMIT 25 OFFSET 0
---
  def index
    if params[:search]
      search_tools
      @tools = @tools.paginate(:page => params[:page], :per_page => 25)
    else
      @tools = Tool.paginate(:page => params[:page], :per_page => 25)

SELECT "tools".* FROM "tools" WHERE "tools"."id" = 2 LIMIT 1
---
  def show
    @tool = Tool.find(params[:id])